УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_НастройкиСбораДанныхДляКвитанцийИОбменов/УПЖКХ_НастройкиСбораДанныхДляКвитанцийИОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_НастройкиСбораДанныхДляКвитанцийИОбменов</name>
  <attributes>
    <name>ВариантСортировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУчетаКомиссииБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОплатыВНачальноеСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключениеНачальнойЗадолженности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаВыводитьДополнительныеОбласти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборУслуг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИндРасходДляВсехУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНачальноеСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбъемыРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОтрицательнуюСуммуКОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьРасчетнуюПлощадь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьШК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаОтбораИтоговойСуммыДо</name>
    <comment>Указывается правая граница отбора по итоговой сумме к оплате.</comment>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаОтбораИтоговойСуммыДоБезОграничений</name>
    <comment>Если Истина, то параметр определяет, что правая граница отбора квитанций не указана.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаОтбораИтоговойСуммыОт</name>
    <comment>Указывается левая граница отбора по итоговой сумме к оплате.</comment>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаОтбораИтоговойСуммыОтБезОграничений</name>
    <comment>Если Истина, то параметр определяет, что левая граница отбора квитанций не указана.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвусторонняяПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвусторонняяПечатьВыводитьОтступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительРасчетов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияБанка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьОтрицательнуюСуммуКОплатеПоУслугам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьПоказанияПоПУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗаполнятьНастройкиПриОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборКвитанций</name>
    <comment>Настройка позволяет выбрать тип отбора квитанций для вывода на печать.</comment>
    <type>
      <types>EnumRef.УПЖКХ_ЗначенияОтбораКвитанций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьОтрывнойКорешок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьОтрывнойКорешокВнизу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьУслугиПоТипам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяПлощадьЗдания</name>
    <type>
      <types>CatalogRef.КВП_ТипыПлощадейЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяПлощадьПомещения</name>
    <type>
      <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
    </type>
  </attributes>
  <attributes>
    <name>УдилитьСортироватьВПределахЗдания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПечатиКвитанцииКапРемонт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПечатиКвитанцииПоПеням</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаУслуг</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугиИсполнителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетОплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНеПечататьНулевыеКвитанции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляПриемаПлатежейПоОсновнымУслугамОтличаетсяОтОсновного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляПриемаПлатежейПоУслугамКапРемонтаОтличаетсяОтОсновного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляПриемаПлатежейПоОсновнымУслугам</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляПриемаПлатежейПоУслугамКапРемонта</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыбранныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УслугиПоТипам</name>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.КВП_ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Коммунальная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеИРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УслугиБезОДН</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ЗначенияОтбораКвитанций/УПЖКХ_ЗначенияОтбораКвитанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ЗначенияОтбораКвитанций</name>
  <enumValues>
    <name>ПечататьВсеКвитанции</name>
    <comment>Параметр определяет, что выводятся все квитанции на печать.</comment>
  </enumValues>
  <enumValues>
    <name>НеПечататьНулевыеКвитанции</name>
    <comment>Параметр определяет, что не выводятся &quot;нулевые&quot; квитанции на печать.</comment>
  </enumValues>
  <enumValues>
    <name>ПечататьКвитанцииСИтоговойСуммойВИнтервале</name>
    <comment>Параметр определяет, что выводятся на печать квитанции, у которых итоговая сумма к оплате находится в указанном интервале.</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_НастройкиСбораДанныхДляКвитанцийИОбменов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

#Область ОбработчикиСобытийОбъекта

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения" объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОтборКвитанций = Перечисления.УПЖКХ_ЗначенияОтбораКвитанций.ПечататьКвитанцииСИтоговойСуммойВИнтервале
	   И НЕ ГраницаОтбораИтоговойСуммыОтБезОграничений
	   И НЕ ГраницаОтбораИтоговойСуммыДоБезОграничений
	   И ГраницаОтбораИтоговойСуммыОт > ГраницаОтбораИтоговойСуммыДо Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неверно указаны границы итоговой суммы для отбора квитанций! Левая граница отбора не должна превышать правую.";
		Сообщение.Поле = "ГраницаОтбораИтоговойСуммыОт";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		ПроверяемыеРеквизиты.Добавить(ПроверяемыеРеквизиты.Найти("ГраницаОтбораИтоговойСуммыОт"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
